/**
**--------------文件信息--------------------------------------------------------------------------------
**文   件   名: delay.h
**创   建   人: 王云飞
**最后修改日期:  2011年5月20日
**描        述: 
** 固件库信息：V2.03             
**--------------历史版本信息----------------------------------------------------------------------------
** 创建人: 王云飞
** 版  本: v0.01
** 日　期: 
** 描　述: 原始版本
**
**--------------当前版本信息----------------------------------------------------------------------------
** 创建人: 王云飞
** 版  本: v0.01
** 日　期:  2011年5月20日
** 描　述: 当前版本
**
**------------------------------------------------------------------------------------------------------*/
#ifndef __DELAY_H
#define __DELAY_H 
			   
#include "stm32f10x.h"
/*使用SysTick的普通计数模式对延迟进行管理
 包括delay_us,delay_ms	 */
void delay_init(u8 SYSCLK);
void delay_ms(u16 nms);
void delay_us(u32 nus);

#endif

